app/controllers/flights_controller.rb

  def index
    @flights = Flight.all
    @open_flights = []
    @closed_flights = []

    @flights.each do |f|
    	if f.seats.length >= f.capacity then
    		@closed_flights.append(f)
    	elsif f.seats.length < f.capacity then
---
SELECT "flights".* FROM "flights"
SELECT "seats".* FROM "seats" WHERE "seats"."flight_id" = ?  [["flight_id", 1]]

  def create
    @flight = Flight.new(flight_params)

    respond_to do |format|
      if @flight.save
---
INSERT INTO "flights" ("departure", "arrival", "baggage_allowance", "capacity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @flight.update(flight_params)
---
UPDATE "flights" SET "capacity" = ?, "updated_at" = ? WHERE "flights"."id" = ?  [["capacity", 1], ["updated_at", "2019-06-06 13:57:21.005721"], ["id", 1]]

    def set_flight
      @flight = Flight.find(params[:id])
---
SELECT  "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]